MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0PGHB/mcu.h
/*  Bit definition for USBHS_HCINT register  */
#define USBHS_HCINT_XFRC_POS                           (0U)
#define USBHS_HCINT_XFRC                               (0x00000001UL)
#define USBHS_HCINT_CHH_POS                            (1U)
#define USBHS_HCINT_CHH                                (0x00000002UL)
#define USBHS_HCINT_AHBERR_POS                         (2U)
#define USBHS_HCINT_AHBERR                             (0x00000004UL)
#define USBHS_HCINT_STALL_POS                          (3U)
#define USBHS_HCINT_STALL                              (0x00000008UL)
#define USBHS_HCINT_NAK_POS                            (4U)
#define USBHS_HCINT_NAK                                (0x00000010UL)
#define USBHS_HCINT_ACK_POS                            (5U)
#define USBHS_HCINT_ACK                                (0x00000020UL)
#define USBHS_HCINT_NYET_POS                           (6U)
#define USBHS_HCINT_NYET                               (0x00000040UL)
#define USBHS_HCINT_TXERR_POS                          (7U)
#define USBHS_HCINT_TXERR                              (0x00000080UL)
#define USBHS_HCINT_BBERR_POS                          (8U)
#define USBHS_HCINT_BBERR                              (0x00000100UL)
#define USBHS_HCINT_FRMOR_POS                          (9U)
#define USBHS_HCINT_FRMOR                              (0x00000200UL)
#define USBHS_HCINT_DTERR_POS                          (10U)
#define USBHS_HCINT_DTERR                              (0x00000400UL)

/*  Bit definition for USBHS_HCINTMSK register  */
#define USBHS_HCINTMSK_XFRCM_POS                       (0U)
#define USBHS_HCINTMSK_XFRCM                           (0x00000001UL)
#define USBHS_HCINTMSK_CHHM_POS                        (1U)
#define USBHS_HCINTMSK_CHHM                            (0x00000002UL)
#define USBHS_HCINTMSK_AHBERRM_POS                     (2U)
#define USBHS_HCINTMSK_AHBERRM                         (0x00000004UL)
#define USBHS_HCINTMSK_STALLM_POS                      (3U)
#define USBHS_HCINTMSK_STALLM                          (0x00000008UL)
#define USBHS_HCINTMSK_NAKM_POS                        (4U)
#define USBHS_HCINTMSK_NAKM                            (0x00000010UL)
#define USBHS_HCINTMSK_ACKM_POS                        (5U)
#define USBHS_HCINTMSK_ACKM                            (0x00000020UL)
#define USBHS_HCINTMSK_NYETM_POS                       (6U)
#define USBHS_HCINTMSK_NYETM                           (0x00000040UL)
#define USBHS_HCINTMSK_TXERRM_POS                      (7U)
#define USBHS_HCINTMSK_TXERRM                          (0x00000080UL)
#define USBHS_HCINTMSK_BBERRM_POS                      (8U)
#define USBHS_HCINTMSK_BBERRM                          (0x00000100UL)
#define USBHS_HCINTMSK_FRMORM_POS                      (9U)
#define USBHS_HCINTMSK_FRMORM                          (0x00000200UL)
#define USBHS_HCINTMSK_DTERRM_POS                      (10U)
#define USBHS_HCINTMSK_DTERRM                          (0x00000400UL)

/*  Bit definition for USBHS_HCTSIZ register  */
#define USBHS_HCTSIZ_XFRSIZ_POS                        (0U)
#define USBHS_HCTSIZ_XFRSIZ                            (0x0007FFFFUL)
#define USBHS_HCTSIZ_PKTCNT_POS                        (19U)
#define USBHS_HCTSIZ_PKTCNT                            (0x1FF80000UL)
#define USBHS_HCTSIZ_DPID_POS                          (29U)
#define USBHS_HCTSIZ_DPID                              (0x60000000UL)
#define USBHS_HCTSIZ_DOPING_POS                        (31U)
#define USBHS_HCTSIZ_DOPING                            (0x80000000UL)

/*  Bit definition for USBHS_HCDMA register  */
#define USBHS_HCDMA                                    (0xFFFFFFFFUL)

/*  Bit definition for USBHS_DCFG register  */
#define USBHS_DCFG_DSPD_POS                            (0U)
#define USBHS_DCFG_DSPD                                (0x00000003UL)
#define USBHS_DCFG_NZLSOHSK_POS                        (2U)
#define USBHS_DCFG_NZLSOHSK                            (0x00000004UL)
#define USBHS_DCFG_DAD_POS                             (4U)
#define USBHS_DCFG_DAD                                 (0x000007F0UL)
#define USBHS_DCFG_PFIVL_POS                           (11U)
#define USBHS_DCFG_PFIVL                               (0x00001800UL)

/*  Bit definition for USBHS_DCTL register  */
#define USBHS_DCTL_RWUSIG_POS                          (0U)
#define USBHS_DCTL_RWUSIG                              (0x00000001UL)
#define USBHS_DCTL_SDIS_POS                            (1U)
#define USBHS_DCTL_SDIS                                (0x00000002UL)
#define USBHS_DCTL_GINSTS_POS                          (2U)
#define USBHS_DCTL_GINSTS                              (0x00000004UL)
#define USBHS_DCTL_GONSTS_POS                          (3U)
#define USBHS_DCTL_GONSTS                              (0x00000008UL)
#define USBHS_DCTL_TCTL_POS                            (4U)
#define USBHS_DCTL_TCTL                                (0x00000070UL)
#define USBHS_DCTL_SGINAK_POS                          (7U)
#define USBHS_DCTL_SGINAK                              (0x00000080UL)
#define USBHS_DCTL_CGINAK_POS                          (8U)
#define USBHS_DCTL_CGINAK                              (0x00000100UL)
#define USBHS_DCTL_SGONAK_POS                          (9U)
#define USBHS_DCTL_SGONAK                              (0x00000200UL)
#define USBHS_DCTL_CGONAK_POS                          (10U)
#define USBHS_DCTL_CGONAK                              (0x00000400UL)
#define USBHS_DCTL_POPRGDNE_POS                        (11U)
#define USBHS_DCTL_POPRGDNE                            (0x00000800UL)

/*  Bit definition for USBHS_DSTS register  */
#define USBHS_DSTS_SUSPSTS_POS                         (0U)
#define USBHS_DSTS_SUSPSTS                             (0x00000001UL)
#define USBHS_DSTS_ENUMSPD_POS                         (1U)
#define USBHS_DSTS_ENUMSPD                             (0x00000006UL)
#define USBHS_DSTS_EERR_POS                            (3U)
#define USBHS_DSTS_EERR                                (0x00000008UL)
#define USBHS_DSTS_FNSOF_POS                           (8U)
#define USBHS_DSTS_FNSOF                               (0x003FFF00UL)
#define USBHS_DSTS_LNSTS_POS                           (22U)
#define USBHS_DSTS_LNSTS                               (0x00C00000UL)

